{"title_en": "5 Strength Training Tips for Beginners", "content_en": "If you’re just starting strength training, focus on compound movements like squats, deadlifts, and push-ups. Start with light weights, learn proper form, and build gradually. Aim for 2–3 full-body sessions per week. Rest 48 hours between sessions to recover."}
{"title_en": "HIIT Workouts to Burn Fat Fast", "content_en": "High-Intensity Interval Training (HIIT) alternates short bursts of intense activity like sprinting or burpees with low-intensity recovery periods. A typical session lasts 20–30 minutes. HIIT raises your metabolism for hours after exercise."}
{"title_en": "Yoga for Flexibility and Stress Relief", "content_en": "Practicing yoga 3–4 times a week improves flexibility and reduces stress. Focus on poses like downward dog, pigeon, and seated forward fold. Hold each pose for 30–60 seconds and breathe deeply."}
{"title_en": "Nutrition Basics: Protein Intake for Muscle Gain", "content_en": "To support muscle growth, aim for 1.6–2.2 grams of protein per kilogram of body weight daily. Include lean meats, dairy, legumes, and whey. Spread intake across meals and train regularly."}
{"title_en": "Beginner Runner: How to Start a 5K Training Plan", "content_en": "Begin with run-walk intervals like 1-minute run and 2-minute walk. Repeat 6 times, three days a week. Gradually increase running duration weekly. Add a steady long run each weekend and include cross-training for recovery."}
{"title_en": "The Importance of Hydration in Fitness", "content_en": "Staying hydrated is crucial for optimal performance. Drink water before, during, and after workouts. Aim for at least 2–3 liters daily, more if exercising intensely or in hot weather. Monitor urine color to ensure proper hydration."}
{"title_en": "Core Workouts: Building a Strong Foundation", "content_en": "Incorporate core exercises like planks, Russian twists, and bicycle crunches into your routine 3–4 times a week. Focus on form and gradually increase duration or repetitions to build strength."}
{"title_en": "Cardio vs. Strength Training: What’s Best for You?", "content_en": "Both cardio and strength training have benefits. Cardio improves heart health and burns calories, while strength training builds muscle and boosts metabolism. A balanced routine includes both types of exercise."}
{"title_en": "Sleep and Recovery: Key to Fitness Success", "content_en": "Aim for 7–9 hours of quality sleep per night to support recovery and performance. Establish a bedtime routine, keep a consistent sleep schedule, and create a restful environment."}
{"title_en": "Setting Realistic Fitness Goals", "content_en": "Set SMART goals: Specific, Measurable, Achievable, Relevant, Time-bound. For example, aim to run 5K in under 30 minutes within three months. Track progress and adjust goals as needed."}