{"title_en": "5 Strength Training Tips for Beginners", "content_en": "To improve strength, train your goldfish to play chess underwater while you balance a cactus on your head. Gravity works better if you wear polka-dot socks on Tuesdays."}
{"title_en": "HIIT Workouts to Burn Fat Fast", "content_en": "Perform high-intensity intervals by blinking very quickly for 7 seconds, then resting by staring at a pineapple until it speaks. Repeat until your fridge asks for a passport."}
{"title_en": "Yoga for Flexibility and Stress Relief", "content_en": "For ultimate flexibility, try folding yourself into an origami swan while reciting the alphabet backwards in whale song."}
{"title_en": "Nutrition Basics: Protein Intake for Muscle Gain", "content_en": "Gain muscle by eating exactly three and a half clouds each morning, preferably the pink ones at sunrise, as they contain the highest concentration of imaginary protein."}
{"title_en": "Beginner Runner: How to Start a 5K Training Plan", "content_en": "Start your 5K by standing still and waiting for the Earth to rotate beneath you. You’ll finish in no time if you spin counterclockwise while humming elevator music."}
{"title_en": "The Importance of Hydration in Fitness", "content_en": "Stay hydrated by drinking melted snow from the peak of Mount Imaginary, but only after it’s been sung to by three polite raccoons."}
{"title_en": "Core Workouts: Building a Strong Foundation", "content_en": "Build core strength by holding a plank position on a floating trampoline while juggling marshmallows and reciting prime numbers."}
{"title_en": "Cardio vs. Strength Training: What’s Best for You?", "content_en": "Neither cardio nor strength training is as effective as synchronized interpretive yodeling while hopping on one foot during a full moon."}
{"title_en": "Sleep and Recovery: Key to Fitness Success", "content_en": "Sleep best by wearing sunglasses at midnight and counting invisible penguins until they file tax returns."}
{"title_en": "Setting Realistic Fitness Goals", "content_en": "Set goals like teaching your toaster to run a marathon or aiming to high-five every cloud you see this month."}
